#ТОКЕНЫ
token = '8098669659:AAFMh2gldlTjFlyIdV3VutBRLEjGhYQBr_E' #Токен бота
api_cryptobot = '323794:AANOP8noXtnVKNazN5cDkxgEako6uldXmSU' # api CryptoBot

#id каналов/чатов
channal_id = -1002479355645 #id игрового канала (Где происходят игры)
ID_SEND_TRANSFER = -1002283537111 #Канал выплат
URL_LOG_CHANNAL =  -1002262162343 #id канала логов


#ОБЩЕЕ
ADMIN = [7943900933] #id Админов, перечислять через запятую
ADMIN_USERNAME = '@antonio_capones' #@Юзерней админа
URL_BOT = 'https://t.me/Casinocapones_bot' #Ссылка на бота
NICNAME = 'Casinocapones_bot' #Username бота без @
NAME_CASINO = 'Slot BAR Casino' #Название вашего казино


#ЛИМИТЫ И ПРОЦЕНТЫ
LIMIT_STAVKA = 30 #Лимит на max ставку
lose_withdraw = 20 #Процент реферальной программы
min_stavka_referal = 10 #Это минимальная сумма ставки для того чтобы получить деньги с реферала
CASHBACK_PROCENT = 10 #Процент кэшбэка от ставки при проигрыше
CASHBACK_LIMIT = 1 #От какой суммы ставки предоставляется кэшбэк
PROCENT_DRAW = 7 #Процент комиссии за ничью
PROCENT_NOT_GAME = 10 #Процент за комиссию при привышении макс ставки или не указания коментария к платежу
TIMER = 16 #Указываем время в секундах в какое n время будет играть фейк ставка когда она будет включена через админ меню, рекомендуемое значение 40 секунд



#Фейк ставки
FAKE_NICKNAME = ['Tmkse', 'YouSand', 'Antonio', 'Александра', 'Миша', 'Alex', 'Vadim', 'МММ 2.0', 'BEAR', 'F`Z', 'Kim', 'Anton K', 'MIX', 'Kerya', 'kira', 'Serjo', 'Falcone'] #Фейк ники
DIAPAZONE_AMOUNT = [2.50, 19.50] #Диапозон сумм фейк ставки


#////////////////////////////////Ключевые слова. НЕ ТРОГАТЬ\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#Кости
Bones = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Ничья', 'Равно', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет']

#Слоты
Slots = ['Слоты']

#Баскетбол
Basketball = ['Баскетбол Гол', 'Баскет Гол', 'Баскетбол Мимо', 'Баскет Мимо']

#Футбол
Fotbool = ['Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо']

#Камень,Ножницы,Бумага
SU_E_FA = ['Камень', 'Ножницы', 'Бумага']


#Колесо
WHEEL = ['Красное', 'Черное', 'Зеленое']


all_text = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет',
            'Слоты', 'Баскетбол Гол', 'Красное', 'Черное', 'Зеленое', 'Баскет Гол', 'Ничья', 'Равно', 'Баскетбол Мимо', 'Баскет Мимо', 'Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо', 'Камень', 'Ножницы', 'Бумага']

#Красные/Черные/Зеленое
RED = ['1', '2', '3', '4', '5', '6', '7']

BLACK = ['8', '9', '10', '11', '12', '13', '14']

GREEN = '0'

